app/views/posts/new.html.erb

SELECT "subs".* FROM "subs"
---
    </label>
    <% Sub.all.each do |sub| %>