app/controllers/comments_controller.rb

    def create
        @comment = Comment.new(comment_params)
        @comment.author_id = current_user.id
        if @comment.save
---
INSERT INTO "comments" ("content", "author_id", "post_id", "parent_comment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "yes?"], ["author_id", 1], ["post_id", 2], ["parent_comment_id", 1], ["created_at", "2019-04-09 23:39:54.576732"], ["updated_at", "2019-04-09 23:39:54.576732"]]