app/controllers/posts_controller.rb

    def show
        @post = Post.find(params[:id])
        @all_comments = Hash.new {|h, k| h[k] = Array.new}
        @post.comments.includes(:author).each do |comment|
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]

    def require_author
        @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]