app/controllers/subs_controller.rb

    def update
        @sub = current_user.subs.find(params[:id])

        if @sub.update(sub_params)
---
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "all of them!"], ["updated_at", "2019-04-09 19:03:14.499923"], ["id", 1]]

    def require_mod
        @sub = Sub.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]